Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES_250124/01.Source/rl78i1c/application/storage/meterdata/r_meter_format.h
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
* NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
* LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
* INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
* ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability 
* of this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2013, 2015 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/***********************************************************************************************************************
* File Name    : r_meter_format.h
* Version      : 1.00
* Device(s)    : RL78/I1C
* Tool-Chain   : CCRL
* H/W Platform : RL78/I1C Energy Meter Platform
* Description  : Storage Format Header file

* Note         : NEED TO CHANGE THIS FILE WHEN
*              :   . EM CORE TYPE DEFINITION IS CHANGED, OR
*              :   . EEPROM START ADDRESS IS CHANGED
* Caution      : DATA ALIGNMENT
*              :    DATA ALIGNMENT ON THIS FORMAT IS 2-BYTES ALIGNMENT, EVEN ADDRESS.
*              :    PLEASE DON'T CHANGE TO OTHER ALIGNMENT SETTING.
*              :    WHEN CHANGE THE DATA ALIGNMENT SETTING, IT WILL DAMAGE THE FORMAT
*              :    ON EEPROM
*              :
*              : BIT FIELD FORMAT
*              :    BIT FIELD FORMAT IS FROM LSB FIRST
*              :    PLEASE DON'T CHANGE THIS SETTING ON THE COMPILE OPTION (IF SUPPORTED)

***********************************************************************************************************************/

#ifndef _STORAGE_FORMAT_H
#define _STORAGE_FORMAT_H

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "r_cg_macrodriver.h"
#include "typedef.h"        /* GSCE Standard Typedef */

/* Middleware */
#include "em_type.h"        /* EM Core Type Definitions */
#include "em_constraint.h"

/* Application */
#include "eeprom.h"         /* EEPROM MW */
#include "r_tariff.h"
#include "r_max_demand.h"
#include "event.h"
#include "r_scheduler.h"
#include "inst_read.h"
#include "r_activity_cal.h"

/******************************************************************************
Macro definitions for Typedef
******************************************************************************/
#define SUPPORT_UNIT_CODE_LEN               (20)
#define SUPPORT_FW_VER_LEN                  (11)
#define SUPPORT_METER_TYPE_LEN              (4)

/* User define */
#define SUPPORT_DEVICEID_LEN (11)
#define BLOCKLOAD_PARTITION (3500) //(95000)
#define DAILY_PARTITION (1000)
#define BILLING_PARTITION (4000)


/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/*====================================================================================================================*/
/* EEPROM Information */
#define STORAGE_EEPROM_START_ADDR 						EPR_DEVICE_START_ADDR   /* EEPROM Start address */
#define STORAGE_EEPROM_SIZE 							EPR_DEVICE_SIZE              /* EEPROM Size */
#define STORAGE_EEPROM_PAGESIZE 						EPR_DEVICE_PAGESIZE      /* EEPROM Page Size */


/*====================================================================================================================*/

#define STORAGE_EEPROM_SUB_MODULE_EM_CORE       (1)
#define STORAGE_EEPROM_SUB_MODULE_GLOBAL        (1)
#define STORAGE_EEPROM_SUB_MODULE_COMMON        (1)
#define STORAGE_EEPROM_SUB_MODULE_ENERGY        (1)
#define STORAGE_EEPROM_SUB_MODULE_ENERGY_MDM    (1)
#define STORAGE_EEPROM_SUB_MODULE_ENERGY_TARIFF (1)
#define STORAGE_EEPROM_SUB_MODULE_SCHEDULER     (1)
#define STORAGE_EEPROM_SUB_MODULE_EVENT_LOG     (1)
#define STORAGE_EEPROM_SUB_MODULE_BLOCKLOAD     (1)
#define STORAGE_EEPROM_SUB_MODULE_DAILYLOAD     (1)
#define STORAGE_EEPROM_SUB_MODULE_BILLING       (1)	
#define STORAGE_EEPROM_SUB_MODULE_CAL           (1)

#if(defined( R_LOAD_CONTROL_ENABLE ) && R_LOAD_CONTROL_ENABLE == TRUE)
    #define STORAGE_EEPROM_SUB_MODULE_LOAD_CTRL     (1)	
#else
    #define STORAGE_EEPROM_SUB_MODULE_LOAD_CTRL     (0)	
#endif

/*****************************************
* Sub module: EM_CORE
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_EM_CORE == 1)

    /* Partition */
    #define STORAGE_EEPROM_EM_CORE_PARTITION_ADDR (STORAGE_EEPROM_START_ADDR + 0)
    #define STORAGE_EEPROM_EM_CORE_PARTITION_SIZE (sizeof(uint8_t) * 256  )


	/* Sub module EM_CORE last address */
    #define STORAGE_EEPROM_EM_CORE_LAST_ADDR (STORAGE_EEPROM_EM_CORE_PARTITION_ADDR + STORAGE_EEPROM_EM_CORE_PARTITION_SIZE)


#endif /* EM_CORE */


/*****************************************
* Sub module: Global
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_GLOBAL == 1)

    /* Header Code */
    #define STORAGE_EEPROM_GLOBAL_HEADER_CODE_ADDR (STORAGE_EEPROM_EM_CORE_LAST_ADDR)
    #define STORAGE_EEPROM_GLOBAL_HEADER_CODE_SIZE (sizeof(uint32_t) )

    /*  Sub module Global padding */
    #define STORAGE_EEPROM_GLOBAL_PADDING_ADDR (STORAGE_EEPROM_GLOBAL_HEADER_CODE_ADDR + STORAGE_EEPROM_GLOBAL_HEADER_CODE_SIZE)
    #define STORAGE_EEPROM_GLOBAL_PADDING_SIZE (10)

