Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES_250124/01.Source/rl78i1c/application/storage/meterdata/r_meter_format.h
	/* Sub module Global last address */
    #define STORAGE_EEPROM_GLOBAL_LAST_ADDR (STORAGE_EEPROM_GLOBAL_PADDING_ADDR + STORAGE_EEPROM_GLOBAL_PADDING_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_GLOBAL_LAST_ADDR)

#endif /* Global */


/*****************************************
* Sub module: Common
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_COMMON == 1)

    /* Rtc */
    #define STORAGE_EEPROM_COMMON_RTC_ADDR (STORAGE_EEPROM_GLOBAL_LAST_ADDR)
    #define STORAGE_EEPROM_COMMON_RTC_SIZE (sizeof(rtc_counter_value_t))
    /* Snapshot_value */
    #define STORAGE_EEPROM_COMMON_SNAPSHOT_VALUE_ADDR (STORAGE_EEPROM_COMMON_RTC_ADDR + STORAGE_EEPROM_COMMON_RTC_SIZE)
    #define STORAGE_EEPROM_COMMON_SNAPSHOT_VALUE_SIZE (sizeof(EM_INST_READ_PARAMS) * 2 )

	/* Sub module Common last address */
    #define STORAGE_EEPROM_COMMON_LAST_ADDR (STORAGE_EEPROM_COMMON_SNAPSHOT_VALUE_ADDR + STORAGE_EEPROM_COMMON_SNAPSHOT_VALUE_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_COMMON_LAST_ADDR)

#endif /* Common */


/*****************************************
* Sub module: Energy_MDM
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_ENERGY_MDM == 1)

    /* State */
    #define STORAGE_EEPROM_ENERGY_MDM_STATE_ADDR (STORAGE_EEPROM_COMMON_LAST_ADDR)
    #define STORAGE_EEPROM_ENERGY_MDM_STATE_SIZE (sizeof(r_mdm_t))
    /* Moving Average buffer */
    #define STORAGE_EEPROM_ENERGY_MDM_MOVING_AVERAGE_BUFFER_ADDR (STORAGE_EEPROM_ENERGY_MDM_STATE_ADDR + STORAGE_EEPROM_ENERGY_MDM_STATE_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_MOVING_AVERAGE_BUFFER_SIZE (sizeof(r_mdm_counter_t) * 15 )
    
    /* Current max value for energy total */
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_ADDR (STORAGE_EEPROM_ENERGY_MDM_MOVING_AVERAGE_BUFFER_ADDR + STORAGE_EEPROM_ENERGY_MDM_MOVING_AVERAGE_BUFFER_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_SIZE (sizeof(r_mdm_counter_t))
	/* Max active value capture time for energy total */
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_CAPTURE_TIME_ADDR (STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_ADDR + STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_CAPTURE_TIME_SIZE (sizeof(rtc_counter_value_t))
	/* Max apparent value capture time for energy total */
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_CAPTURE_TIME_ADDR (STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_CAPTURE_TIME_ADDR + STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_CAPTURE_TIME_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_CAPTURE_TIME_SIZE (sizeof(rtc_counter_value_t))
	
    /* Current max value for each timezone */
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_TZ_ADDR (STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_CAPTURE_TIME_ADDR + STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_CAPTURE_TIME_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_TZ_SIZE (sizeof(r_mdm_counter_t) * 8 )
    /* Max active value capture time for each timezone*/
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_TZ_CAPTURE_TIME_ADDR (STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_TZ_ADDR + STORAGE_EEPROM_ENERGY_MDM_MAX_VALUE_TZ_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_TZ_CAPTURE_TIME_SIZE (sizeof(rtc_counter_value_t) * 8 )
	/* Max apparent value capture time for each timezone*/
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_TZ_CAPTURE_TIME_ADDR (STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_TZ_CAPTURE_TIME_ADDR + STORAGE_EEPROM_ENERGY_MDM_MAX_ACTIVE_TZ_CAPTURE_TIME_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_TZ_CAPTURE_TIME_SIZE (sizeof(rtc_counter_value_t) * 8 )
	
	/*  Sub module Energy_MDM padding */
    #define STORAGE_EEPROM_ENERGY_MDM_PADDING_ADDR (STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_TZ_CAPTURE_TIME_ADDR + STORAGE_EEPROM_ENERGY_MDM_MAX_APPARENT_TZ_CAPTURE_TIME_SIZE)
    #define STORAGE_EEPROM_ENERGY_MDM_PADDING_SIZE (10)

	/* Sub module Energy_MDM last address */
    #define STORAGE_EEPROM_ENERGY_MDM_LAST_ADDR (STORAGE_EEPROM_ENERGY_MDM_PADDING_ADDR + STORAGE_EEPROM_ENERGY_MDM_PADDING_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_ENERGY_MDM_LAST_ADDR)

#endif /* Energy_MDM */


/*****************************************
* Sub module: Energy_Tariff
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_ENERGY_TARIFF == 1)

    /* State */
    #define STORAGE_EEPROM_ENERGY_TARIFF_STATE_ADDR (STORAGE_EEPROM_ENERGY_MDM_LAST_ADDR)
    #define STORAGE_EEPROM_ENERGY_TARIFF_STATE_SIZE (sizeof(r_tariff_t))
    /* Tz */
    #define STORAGE_EEPROM_ENERGY_TARIFF_TZ_ADDR (STORAGE_EEPROM_ENERGY_TARIFF_STATE_ADDR + STORAGE_EEPROM_ENERGY_TARIFF_STATE_SIZE)
    #define STORAGE_EEPROM_ENERGY_TARIFF_TZ_SIZE (sizeof(r_tariff_counter_t) * 16 )
    /* Lookup Timeslot-tariff_number */
    #define STORAGE_EEPROM_ENERGY_TARIFF_LOOKUP_TIMESLOT_TARIFF_NUMBER_ADDR (STORAGE_EEPROM_ENERGY_TARIFF_TZ_ADDR + STORAGE_EEPROM_ENERGY_TARIFF_TZ_SIZE)
    #define STORAGE_EEPROM_ENERGY_TARIFF_LOOKUP_TIMESLOT_TARIFF_NUMBER_SIZE (sizeof(uint8_t) * 16)
    /*  Sub module Energy_Tariff padding */
    #define STORAGE_EEPROM_ENERGY_TARIFF_PADDING_ADDR (STORAGE_EEPROM_ENERGY_TARIFF_LOOKUP_TIMESLOT_TARIFF_NUMBER_ADDR + STORAGE_EEPROM_ENERGY_TARIFF_LOOKUP_TIMESLOT_TARIFF_NUMBER_SIZE)
    #define STORAGE_EEPROM_ENERGY_TARIFF_PADDING_SIZE (10)

	/* Sub module Energy_Tariff last address */
    #define STORAGE_EEPROM_ENERGY_TARIFF_LAST_ADDR (STORAGE_EEPROM_ENERGY_TARIFF_PADDING_ADDR + STORAGE_EEPROM_ENERGY_TARIFF_PADDING_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_ENERGY_TARIFF_LAST_ADDR)

#endif /* Energy_Tariff */


/*****************************************
* Sub module: Scheduler
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_SCHEDULER == 1)

    /* Data */
    #define STORAGE_EEPROM_SCHEDULER_DATA_ADDR (STORAGE_EEPROM_ENERGY_TARIFF_LAST_ADDR)
    #define STORAGE_EEPROM_SCHEDULER_DATA_SIZE (sizeof(scheduler_storage_t) * MAX_SCHEDULER_NUMBER)
    /* SAS date time */
    #define STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR (STORAGE_EEPROM_SCHEDULER_DATA_ADDR + STORAGE_EEPROM_SCHEDULER_DATA_SIZE)
    #define STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_SIZE (sizeof(r_scheduler_datetime_t) * SCHEDULE_EXECUTION_TIME_MAX_SUPPORT)
    /* SAS execution flag */
    #define STORAGE_EEPROM_SCHEDULER_SAS_EXECUTION_FLAG_ADDR (STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR + STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_SIZE)
    #define STORAGE_EEPROM_SCHEDULER_SAS_EXECUTION_FLAG_SIZE (sizeof(uint16_t) * MAX_SCHEDULER_NUMBER)
    /* Demand Integration Period */
    #define STORAGE_EEPROM_SCHEDULER_DEMAND_INTEGRATION_PERIOD_ADDR (STORAGE_EEPROM_SCHEDULER_SAS_EXECUTION_FLAG_ADDR + STORAGE_EEPROM_SCHEDULER_SAS_EXECUTION_FLAG_SIZE)
    #define STORAGE_EEPROM_SCHEDULER_DEMAND_INTEGRATION_PERIOD_SIZE (sizeof(uint16_t))
    /* Demand Number of Period */
    #define STORAGE_EEPROM_SCHEDULER_DEMAND_NUMBER_OF_PERIOD_ADDR (STORAGE_EEPROM_SCHEDULER_DEMAND_INTEGRATION_PERIOD_ADDR + STORAGE_EEPROM_SCHEDULER_DEMAND_INTEGRATION_PERIOD_SIZE)
    #define STORAGE_EEPROM_SCHEDULER_DEMAND_NUMBER_OF_PERIOD_SIZE (sizeof(uint16_t))
    /*  Sub module Scheduler padding */
    #define STORAGE_EEPROM_SCHEDULER_PADDING_ADDR (STORAGE_EEPROM_SCHEDULER_DEMAND_NUMBER_OF_PERIOD_ADDR + STORAGE_EEPROM_SCHEDULER_DEMAND_NUMBER_OF_PERIOD_SIZE)
    #define STORAGE_EEPROM_SCHEDULER_PADDING_SIZE (10)

