Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES_250124/01.Source/rl78i1c/application/storage/meterdata/r_meter_format.h
	/* Sub module Scheduler last address */
    #define STORAGE_EEPROM_SCHEDULER_LAST_ADDR (STORAGE_EEPROM_SCHEDULER_PADDING_ADDR + STORAGE_EEPROM_SCHEDULER_PADDING_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_SCHEDULER_LAST_ADDR)

#endif /* Scheduler */


/*****************************************
* Sub module: Event_Log
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_EVENT_LOG == 1)

    /* Header code */
    #define STORAGE_EEPROM_EVENT_LOG_HEADER_CODE_ADDR (STORAGE_EEPROM_SCHEDULER_LAST_ADDR)
    #define STORAGE_EEPROM_EVENT_LOG_HEADER_CODE_SIZE (sizeof(uint32_t) )

    /* Event State */
    #define STORAGE_EEPROM_EVENT_LOG_EVENT_STATE_ADDR (STORAGE_EEPROM_EVENT_LOG_HEADER_CODE_ADDR + STORAGE_EEPROM_EVENT_LOG_HEADER_CODE_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_EVENT_STATE_SIZE (sizeof(EVENT_INFO))
    /* Tamper Counter */
    #define STORAGE_EEPROM_EVENT_LOG_TAMPER_COUNTER_ADDR (STORAGE_EEPROM_EVENT_LOG_EVENT_STATE_ADDR + STORAGE_EEPROM_EVENT_LOG_EVENT_STATE_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_TAMPER_COUNTER_SIZE (sizeof(uint32_t))
    /* Table info */
    #define STORAGE_EEPROM_EVENT_LOG_TABLE_INFO_ADDR (STORAGE_EEPROM_EVENT_LOG_TAMPER_COUNTER_ADDR + STORAGE_EEPROM_EVENT_LOG_TAMPER_COUNTER_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_TABLE_INFO_SIZE (sizeof(EventTableHeader_t) * 7 )
    /* Voltage */
    #define STORAGE_EEPROM_EVENT_LOG_VOLTAGE_ADDR (STORAGE_EEPROM_EVENT_LOG_TABLE_INFO_ADDR + STORAGE_EEPROM_EVENT_LOG_TABLE_INFO_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_VOLTAGE_SIZE (sizeof(EVENT_PARAMS_T) * VOLTAGE_EVENTS_MAX_ENTRIES)
    /* Current */
    #define STORAGE_EEPROM_EVENT_LOG_CURRENT_ADDR (STORAGE_EEPROM_EVENT_LOG_VOLTAGE_ADDR + STORAGE_EEPROM_EVENT_LOG_VOLTAGE_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_CURRENT_SIZE (sizeof(EVENT_PARAMS_T) * CURRENT_EVENTS_MAX_ENTRIES)
    /* Power */
    #define STORAGE_EEPROM_EVENT_LOG_POWER_ADDR (STORAGE_EEPROM_EVENT_LOG_CURRENT_ADDR + STORAGE_EEPROM_EVENT_LOG_CURRENT_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_POWER_SIZE (sizeof(EVENT_PARAMS_SHORT_T) * POWER_EVENTS_MAX_ENTRIES)
    /* Transaction */
    #define STORAGE_EEPROM_EVENT_LOG_TRANSACTION_ADDR (STORAGE_EEPROM_EVENT_LOG_POWER_ADDR + STORAGE_EEPROM_EVENT_LOG_POWER_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_TRANSACTION_SIZE (sizeof(EVENT_PARAMS_SHORT_T) * TRANS_EVENTS_MAX_ENTRIES)
    /* Other */
    #define STORAGE_EEPROM_EVENT_LOG_OTHER_ADDR (STORAGE_EEPROM_EVENT_LOG_TRANSACTION_ADDR + STORAGE_EEPROM_EVENT_LOG_TRANSACTION_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_OTHER_SIZE (sizeof(EVENT_PARAMS_T) * OTHER_EVENTS_MAX_ENTRIES)
    /* Nonrollover */
    #define STORAGE_EEPROM_EVENT_LOG_NONROLLOVER_ADDR (STORAGE_EEPROM_EVENT_LOG_OTHER_ADDR + STORAGE_EEPROM_EVENT_LOG_OTHER_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_NONROLLOVER_SIZE (sizeof(EVENT_PARAMS_SHORT_T) * NON_ROLLOVER_EVENTS_MAX_ENTRIES)
    /* Control */
    #define STORAGE_EEPROM_EVENT_LOG_CONTROL_ADDR (STORAGE_EEPROM_EVENT_LOG_NONROLLOVER_ADDR + STORAGE_EEPROM_EVENT_LOG_NONROLLOVER_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_CONTROL_SIZE (sizeof(EVENT_PARAMS_SHORT_T) * CONTROL_EVENTS_MAX_ENTRIES)
    /*  Sub module Event_Log padding */
    #define STORAGE_EEPROM_EVENT_LOG_PADDING_ADDR (STORAGE_EEPROM_EVENT_LOG_CONTROL_ADDR + STORAGE_EEPROM_EVENT_LOG_CONTROL_SIZE)
    #define STORAGE_EEPROM_EVENT_LOG_PADDING_SIZE (10)

	/* Sub module Event_Log last address */
    #define STORAGE_EEPROM_EVENT_LOG_LAST_ADDR (STORAGE_EEPROM_EVENT_LOG_PADDING_ADDR + STORAGE_EEPROM_EVENT_LOG_PADDING_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_EVENT_LOG_LAST_ADDR)

#endif /* Event_Log */


/*****************************************
* Sub module: Blockload
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_BLOCKLOAD == 1)

    /* Partition */
    #define STORAGE_EEPROM_BLOCKLOAD_PARTITION_ADDR (STORAGE_EEPROM_EVENT_LOG_LAST_ADDR)
    #define STORAGE_EEPROM_BLOCKLOAD_PARTITION_SIZE (sizeof(uint8_t) * BLOCKLOAD_PARTITION)

	/* Sub module Blockload last address */
    #define STORAGE_EEPROM_BLOCKLOAD_LAST_ADDR (STORAGE_EEPROM_BLOCKLOAD_PARTITION_ADDR + STORAGE_EEPROM_BLOCKLOAD_PARTITION_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_BLOCKLOAD_LAST_ADDR)

#endif /* Blockload */


/*****************************************
* Sub module: Dailyload
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_DAILYLOAD == 1)

    /* Partition */
    #define STORAGE_EEPROM_DAILYLOAD_PARTITION_ADDR (STORAGE_EEPROM_BLOCKLOAD_LAST_ADDR)
    #define STORAGE_EEPROM_DAILYLOAD_PARTITION_SIZE (sizeof(uint8_t) * DAILY_PARTITION)
    /*  Sub module Dailyload padding */
    #define STORAGE_EEPROM_DAILYLOAD_PADDING_ADDR (STORAGE_EEPROM_DAILYLOAD_PARTITION_ADDR + STORAGE_EEPROM_DAILYLOAD_PARTITION_SIZE)
    #define STORAGE_EEPROM_DAILYLOAD_PADDING_SIZE (10)

	/* Sub module Dailyload last address */
    #define STORAGE_EEPROM_DAILYLOAD_LAST_ADDR (STORAGE_EEPROM_DAILYLOAD_PADDING_ADDR + STORAGE_EEPROM_DAILYLOAD_PADDING_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_DAILYLOAD_LAST_ADDR)

#endif /* Dailyload */


/*****************************************
* Sub module: Billing
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_BILLING == 1)

    /* Partition */
    #define STORAGE_EEPROM_BILLING_PARTITION_ADDR (STORAGE_EEPROM_DAILYLOAD_LAST_ADDR)
    #define STORAGE_EEPROM_BILLING_PARTITION_SIZE (sizeof(uint8_t) * BILLING_PARTITION)
    /*  Sub module Billing padding */
    #define STORAGE_EEPROM_BILLING_PADDING_ADDR (STORAGE_EEPROM_BILLING_PARTITION_ADDR + STORAGE_EEPROM_BILLING_PARTITION_SIZE)
    #define STORAGE_EEPROM_BILLING_PADDING_SIZE (10)

	/* Sub module Billing last address */
    #define STORAGE_EEPROM_BILLING_LAST_ADDR (STORAGE_EEPROM_BILLING_PADDING_ADDR + STORAGE_EEPROM_BILLING_PADDING_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_BILLING_LAST_ADDR)

#endif /* Billing */


/*****************************************
* Sub module: Cal
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_CAL == 1)

