Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES_250124/01.Source/rl78i1c/application/storage/meterdata/r_meter_format.h
    /* Name_active */
    #define STORAGE_EEPROM_CAL_NAME_ACTIVE_ADDR (STORAGE_EEPROM_BILLING_LAST_ADDR)
    #define STORAGE_EEPROM_CAL_NAME_ACTIVE_SIZE (sizeof(r_act_cal_name_t))
    /* Season_active */
    #define STORAGE_EEPROM_CAL_SEASON_ACTIVE_ADDR (STORAGE_EEPROM_CAL_NAME_ACTIVE_ADDR + STORAGE_EEPROM_CAL_NAME_ACTIVE_SIZE)
    #define STORAGE_EEPROM_CAL_SEASON_ACTIVE_SIZE (sizeof(r_act_cal_season_profile_t))
    /* Week_active */
    #define STORAGE_EEPROM_CAL_WEEK_ACTIVE_ADDR (STORAGE_EEPROM_CAL_SEASON_ACTIVE_ADDR + STORAGE_EEPROM_CAL_SEASON_ACTIVE_SIZE)
    #define STORAGE_EEPROM_CAL_WEEK_ACTIVE_SIZE (sizeof(r_act_cal_week_profile_t))
    /* Day_active */
    #define STORAGE_EEPROM_CAL_DAY_ACTIVE_ADDR (STORAGE_EEPROM_CAL_WEEK_ACTIVE_ADDR + STORAGE_EEPROM_CAL_WEEK_ACTIVE_SIZE)
    #define STORAGE_EEPROM_CAL_DAY_ACTIVE_SIZE (sizeof(r_act_cal_day_profile_t))
    /* Name_passive */
    #define STORAGE_EEPROM_CAL_NAME_PASSIVE_ADDR (STORAGE_EEPROM_CAL_DAY_ACTIVE_ADDR + STORAGE_EEPROM_CAL_DAY_ACTIVE_SIZE)
    #define STORAGE_EEPROM_CAL_NAME_PASSIVE_SIZE (sizeof(r_act_cal_name_t))
    /* season_passive */
    #define STORAGE_EEPROM_CAL_SEASON_PASSIVE_ADDR (STORAGE_EEPROM_CAL_NAME_PASSIVE_ADDR + STORAGE_EEPROM_CAL_NAME_PASSIVE_SIZE)
    #define STORAGE_EEPROM_CAL_SEASON_PASSIVE_SIZE (sizeof(r_act_cal_season_profile_t))
    /* week_passive */
    #define STORAGE_EEPROM_CAL_WEEK_PASSIVE_ADDR (STORAGE_EEPROM_CAL_SEASON_PASSIVE_ADDR + STORAGE_EEPROM_CAL_SEASON_PASSIVE_SIZE)
    #define STORAGE_EEPROM_CAL_WEEK_PASSIVE_SIZE (sizeof(r_act_cal_week_profile_t))
    /* day_passive */
    #define STORAGE_EEPROM_CAL_DAY_PASSIVE_ADDR (STORAGE_EEPROM_CAL_WEEK_PASSIVE_ADDR + STORAGE_EEPROM_CAL_WEEK_PASSIVE_SIZE)
    #define STORAGE_EEPROM_CAL_DAY_PASSIVE_SIZE (sizeof(r_act_cal_day_profile_t))
    /* activation_time */
    #define STORAGE_EEPROM_CAL_ACTIVATION_TIME_ADDR (STORAGE_EEPROM_CAL_DAY_PASSIVE_ADDR + STORAGE_EEPROM_CAL_DAY_PASSIVE_SIZE)
    #define STORAGE_EEPROM_CAL_ACTIVATION_TIME_SIZE (sizeof(rtc_counter_value_t))
    /* exe_state */
    #define STORAGE_EEPROM_CAL_EXE_STATE_ADDR (STORAGE_EEPROM_CAL_ACTIVATION_TIME_ADDR + STORAGE_EEPROM_CAL_ACTIVATION_TIME_SIZE)
    #define STORAGE_EEPROM_CAL_EXE_STATE_SIZE (sizeof(uint8_t))
    /* processing_state */
    #define STORAGE_EEPROM_CAL_PROCESSING_STATE_ADDR (STORAGE_EEPROM_CAL_EXE_STATE_ADDR + STORAGE_EEPROM_CAL_EXE_STATE_SIZE)
    #define STORAGE_EEPROM_CAL_PROCESSING_STATE_SIZE (sizeof(uint8_t))
    /* active_state */
    #define STORAGE_EEPROM_CAL_ACTIVE_STATE_ADDR (STORAGE_EEPROM_CAL_PROCESSING_STATE_ADDR + STORAGE_EEPROM_CAL_PROCESSING_STATE_SIZE)
    #define STORAGE_EEPROM_CAL_ACTIVE_STATE_SIZE (sizeof(uint8_t))
    /* season_state */
    #define STORAGE_EEPROM_CAL_SEASON_STATE_ADDR (STORAGE_EEPROM_CAL_ACTIVE_STATE_ADDR + STORAGE_EEPROM_CAL_ACTIVE_STATE_SIZE)
    #define STORAGE_EEPROM_CAL_SEASON_STATE_SIZE (sizeof(uint8_t))
    /* activation_time_long */
    #define STORAGE_EEPROM_CAL_ACTIVATION_TIME_LONG_ADDR (STORAGE_EEPROM_CAL_SEASON_STATE_ADDR + STORAGE_EEPROM_CAL_SEASON_STATE_SIZE)
    #define STORAGE_EEPROM_CAL_ACTIVATION_TIME_LONG_SIZE (sizeof(uint8_t) * 12 )

	/* Sub module Cal last address */
    #define STORAGE_EEPROM_CAL_LAST_ADDR (STORAGE_EEPROM_CAL_ACTIVATION_TIME_LONG_ADDR + STORAGE_EEPROM_CAL_ACTIVATION_TIME_LONG_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_CAL_LAST_ADDR)

#endif /* Cal */


/*****************************************
* Sub module: Load ctrl
******************************************/
#if (STORAGE_EEPROM_SUB_MODULE_LOAD_CTRL == 1)

    /* state */
    #define STORAGE_EEPROM_LOAD_CTRL_STATE_ADDR (STORAGE_EEPROM_CAL_LAST_ADDR)
    #define STORAGE_EEPROM_LOAD_CTRL_STATE_SIZE (sizeof(uint8_t))
    /* mode */
    #define STORAGE_EEPROM_LOAD_CTRL_MODE_ADDR (STORAGE_EEPROM_LOAD_CTRL_STATE_ADDR + STORAGE_EEPROM_LOAD_CTRL_STATE_SIZE)
    #define STORAGE_EEPROM_LOAD_CTRL_MODE_SIZE (sizeof(uint8_t))
    /* threshold normal */
    #define STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_NORMAL_ADDR (STORAGE_EEPROM_LOAD_CTRL_MODE_ADDR + STORAGE_EEPROM_LOAD_CTRL_MODE_SIZE)
    #define STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_NORMAL_SIZE (sizeof(uint32_t))
    /* threshold emergency */
    #define STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_EMERGENCY_ADDR (STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_NORMAL_ADDR + STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_NORMAL_SIZE)
    #define STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_EMERGENCY_SIZE (sizeof(uint32_t))
    /* min over duration */
    #define STORAGE_EEPROM_LOAD_CTRL_MIN_OVER_DURATION_ADDR (STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_EMERGENCY_ADDR + STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_EMERGENCY_SIZE)
    #define STORAGE_EEPROM_LOAD_CTRL_MIN_OVER_DURATION_SIZE (sizeof(uint32_t))
    /* min under duration */
    #define STORAGE_EEPROM_LOAD_CTRL_MIN_UNDER_DURATION_ADDR (STORAGE_EEPROM_LOAD_CTRL_MIN_OVER_DURATION_ADDR + STORAGE_EEPROM_LOAD_CTRL_MIN_OVER_DURATION_SIZE)
    #define STORAGE_EEPROM_LOAD_CTRL_MIN_UNDER_DURATION_SIZE (sizeof(uint32_t))
    /* Relay status */
    #define STORAGE_EEPROM_LOAD_CTRL_RELAY_STATUS_ADDR (STORAGE_EEPROM_LOAD_CTRL_MIN_UNDER_DURATION_ADDR + STORAGE_EEPROM_LOAD_CTRL_MIN_UNDER_DURATION_SIZE)
    #define STORAGE_EEPROM_LOAD_CTRL_RELAY_STATUS_SIZE (sizeof(uint8_t))
    /* Relay Progress Status */
    #define STORAGE_EEPROM_LOAD_CTRL_RELAY_PROGRESS_STATUS_ADDR (STORAGE_EEPROM_LOAD_CTRL_RELAY_STATUS_ADDR + STORAGE_EEPROM_LOAD_CTRL_RELAY_STATUS_SIZE)
    #define STORAGE_EEPROM_LOAD_CTRL_RELAY_PROGRESS_STATUS_SIZE (sizeof(RelayProgessStatus_t))

	/* Sub module Load ctrl last address */
    #define STORAGE_EEPROM_LOAD_CTRL_LAST_ADDR (STORAGE_EEPROM_LOAD_CTRL_RELAY_PROGRESS_STATUS_ADDR + STORAGE_EEPROM_LOAD_CTRL_RELAY_PROGRESS_STATUS_SIZE)

    #undef STORAGE_EEPROM_METER_FORMAT_LAST_ADDR
    #define STORAGE_EEPROM_METER_FORMAT_LAST_ADDR	(STORAGE_EEPROM_LOAD_CTRL_LAST_ADDR)

#endif /* Load ctrl */


/*====================================================================================================================*/

