Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES_250124/01.Source/rl78i1c/application/storage/meterdata/r_meter_format.h
STATIC_ASSERT(STORAGE_EEPROM_GLOBAL_HEADER_CODE_ADDR    > 0x00FF                                 );
STATIC_ASSERT(STORAGE_EEPROM_COMMON_RTC_ADDR            >= STORAGE_EEPROM_GLOBAL_LAST_ADDR       );
STATIC_ASSERT(STORAGE_EEPROM_ENERGY_MDM_STATE_ADDR      >= STORAGE_EEPROM_COMMON_RTC_ADDR        );
STATIC_ASSERT(STORAGE_EEPROM_ENERGY_TARIFF_STATE_ADDR   >= STORAGE_EEPROM_ENERGY_MDM_LAST_ADDR   );
STATIC_ASSERT(STORAGE_EEPROM_SCHEDULER_DATA_ADDR        >= STORAGE_EEPROM_ENERGY_TARIFF_LAST_ADDR);
STATIC_ASSERT(STORAGE_EEPROM_EVENT_LOG_HEADER_CODE_ADDR >= STORAGE_EEPROM_SCHEDULER_LAST_ADDR    );
STATIC_ASSERT(STORAGE_EEPROM_BLOCKLOAD_PARTITION_ADDR   >= STORAGE_EEPROM_EVENT_LOG_LAST_ADDR    );
STATIC_ASSERT(STORAGE_EEPROM_DAILYLOAD_PARTITION_ADDR   >= STORAGE_EEPROM_BLOCKLOAD_LAST_ADDR    );
STATIC_ASSERT(STORAGE_EEPROM_BILLING_PARTITION_ADDR     >= STORAGE_EEPROM_DAILYLOAD_LAST_ADDR    );
STATIC_ASSERT(STORAGE_EEPROM_CAL_NAME_ACTIVE_ADDR       >= STORAGE_EEPROM_BILLING_LAST_ADDR      );

#if (STORAGE_EEPROM_SUB_MODULE_LOAD_CTRL == 1)
STATIC_ASSERT(STORAGE_EEPROM_LOAD_CTRL_STATE_ADDR       >= STORAGE_EEPROM_CAL_LAST_ADDR          );
#endif

/*************************************************************************************************************************
 * DATAFLASH
*********************************************************************************************************************** */

#define STORAGE_CONFIG_NAMEPLATE_START_ADDR   (0x0000)
#define STORAGE_CONFIG_SUB_MODULE_NAMEPLATE (1)	

/*****************************************
* Sub module: Nameplate
******************************************/
#if (STORAGE_CONFIG_SUB_MODULE_NAMEPLATE == 1)

    /* FlagID */
    #define STORAGE_CONFIG_NAMEPLATE_FLAGID_ADDR (STORAGE_CONFIG_NAMEPLATE_START_ADDR + 512)
    #define STORAGE_CONFIG_NAMEPLATE_FLAGID_SIZE (sizeof(uint8_t) * 4  )

    /* SN */
    #define STORAGE_CONFIG_NAMEPLATE_SN_ADDR (STORAGE_CONFIG_NAMEPLATE_FLAGID_ADDR + STORAGE_CONFIG_NAMEPLATE_FLAGID_SIZE)
    #define STORAGE_CONFIG_NAMEPLATE_SN_SIZE (sizeof(uint8_t) * 20 )
    /* Mfr name */
    #define STORAGE_CONFIG_NAMEPLATE_MFR_NAME_ADDR (STORAGE_CONFIG_NAMEPLATE_SN_ADDR + STORAGE_CONFIG_NAMEPLATE_SN_SIZE)
    #define STORAGE_CONFIG_NAMEPLATE_MFR_NAME_SIZE (sizeof(uint8_t) * 50 )
    /* FW version */
    #define STORAGE_CONFIG_NAMEPLATE_FW_VERSION_ADDR (STORAGE_CONFIG_NAMEPLATE_MFR_NAME_ADDR + STORAGE_CONFIG_NAMEPLATE_MFR_NAME_SIZE)
    #define STORAGE_CONFIG_NAMEPLATE_FW_VERSION_SIZE (sizeof(uint8_t) * 16 )
    /* Meter Type */
    #define STORAGE_CONFIG_NAMEPLATE_METER_TYPE_ADDR (STORAGE_CONFIG_NAMEPLATE_FW_VERSION_ADDR + STORAGE_CONFIG_NAMEPLATE_FW_VERSION_SIZE)
    #define STORAGE_CONFIG_NAMEPLATE_METER_TYPE_SIZE (sizeof(uint8_t) * 2 )
    /* Category */
    #define STORAGE_CONFIG_NAMEPLATE_CATEGORY_ADDR (STORAGE_CONFIG_NAMEPLATE_METER_TYPE_ADDR + STORAGE_CONFIG_NAMEPLATE_METER_TYPE_SIZE)
    #define STORAGE_CONFIG_NAMEPLATE_CATEGORY_SIZE (sizeof(uint8_t) * 2 )
    /* LDN */
    #define STORAGE_CONFIG_NAMEPLATE_LDN_ADDR (STORAGE_CONFIG_NAMEPLATE_CATEGORY_ADDR + STORAGE_CONFIG_NAMEPLATE_CATEGORY_SIZE)
    #define STORAGE_CONFIG_NAMEPLATE_LDN_SIZE (sizeof(uint8_t) * 10 )

	/* Sub module Nameplate last address */
    #define STORAGE_CONFIG_NAMEPLATE_LAST_ADDR (STORAGE_CONFIG_NAMEPLATE_LDN_ADDR + STORAGE_CONFIG_NAMEPLATE_LDN_SIZE)


#endif /* Nameplate */

/***********************************************************************************************************************
Variable Externs
***********************************************************************************************************************/

/***********************************************************************************************************************
Functions Prototypes
***********************************************************************************************************************/

#endif /* _STORAGE_FORMAT_H */

